AngularSpecter/Laser_controller/Workspace/Laser Controller/driverlib/MSP430F5xx_6xx/usci_uart.c
    return ( retVal) ;
}

//*****************************************************************************
//
//! Transmits a byte from the UART Module.
//!
//! \param baseAddress is the base address of the UART module.
//! \param transmitData data to be transmitted from the UART module
//!
//! This function will place the supplied data into UART trasmit data register
//! to start transmission
//!
//! Modified register is \b UCAxTXBUF
//! \return None.
//
//*****************************************************************************
void USCI_UART_transmitData ( uint32_t baseAddress,
    uint8_t transmitData
    )
{
    HWREG8(baseAddress + OFS_UCAxTXBUF) = transmitData;
}

//*****************************************************************************
//
//! Receives a byte that has been sent to the UART Module.
//!
//! \param baseAddress is the base address of the UART module.
//!
//! This function reads a byte of data from the UART receive data Register.
//!
//! Modified register is \b UCAxRXBUF
//!
//! \return Returns the byte received from by the UART module, cast as an
//! uint8_t.
//
//*****************************************************************************
uint8_t USCI_UART_receiveData (uint32_t baseAddress)
{
    return ( HWREG8(baseAddress + OFS_UCAxRXBUF)) ;
}

//*****************************************************************************
//
//! Enables individual UART interrupt sources.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!
//! Enables the indicated UART interrupt sources.  The interrupt flag is first
//! and then the corresponfing interrupt is enabled. Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor. <b>Does not clear interrupt flags.</b>
//!
//! The mask parameter is the logical OR of any of the following:
//! - \b USCI_UART_RECEIVE_INTERRUPT -Receive interrupt
//! - \b USCI_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//! - \b USCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive erroneous-character
//!                             interrupt enable
//! - \b USCI_UART_BREAKCHAR_INTERRUPT - Receive break character interrupt enable
//!
//! Modified register is \b UCAxIFG, \b UCAxIE and \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void USCI_UART_enableInterrupt (uint32_t baseAddress,
    uint8_t mask
    )
{
    assert( 0x00 != mask && (USCI_UART_RECEIVE_INTERRUPT +
			USCI_UART_TRANSMIT_INTERRUPT +
			USCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT +
			USCI_UART_BREAKCHAR_INTERRUPT
			) );
			
    switch (mask){
        case USCI_UART_RECEIVE_INTERRUPT:
        case USCI_UART_TRANSMIT_INTERRUPT:
            //Enable Interrupt
            HWREG8(baseAddress + OFS_UCAxIE) |= mask;
            break;
        case USCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT:
        case USCI_UART_BREAKCHAR_INTERRUPT:
            //Enable Interrupt
            HWREG8(baseAddress + OFS_UCAxCTL1) |= mask;
            break;
    }
}

//*****************************************************************************
//
//! Disables individual UART interrupt sources.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the bit mask of the interrupt sources to be
//! disabled.
//!
//! Disables the indicated UART interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//!
//! The mask parameter is the logical OR of any of the following:
//! - \b USCI_UART_RECEIVE_INTERRUPT -Receive interrupt
//! - \b USCI_UART_TRANSMIT_INTERRUPT - Transmit interrupt
//! - \b USCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT - Receive erroneous-character
//!                             interrupt enable
//! - \b USCI_UART_BREAKCHAR_INTERRUPT - Receive break character interrupt enable
//!
//! Modified register is \b UCAxIFG, \b UCAxIE and \b UCAxCTL1
//! \return None.
//
//*****************************************************************************
void USCI_UART_disableInterrupt (uint32_t baseAddress,
    uint8_t mask
    )
{
   assert( 0x00 != mask && (USCI_UART_RECEIVE_INTERRUPT +
			USCI_UART_TRANSMIT_INTERRUPT +
			USCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT +
			USCI_UART_BREAKCHAR_INTERRUPT
			) );

    switch (mask){
        case USCI_UART_RECEIVE_INTERRUPT:
        case USCI_UART_TRANSMIT_INTERRUPT:
            //Disable Interrupt
            HWREG8(baseAddress + OFS_UCAxIE) &= ~mask;
            break;
        case USCI_UART_RECEIVE_ERRONEOUSCHAR_INTERRUPT:
        case USCI_UART_BREAKCHAR_INTERRUPT:
            //Disable Interrupt
            HWREG8(baseAddress + OFS_UCAxCTL1) &= ~mask;
            break;
    }
}

//*****************************************************************************
//
//! Gets the current UART interrupt status.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!
//! This returns the interrupt status for the UART  module based on which
//! flag is passed. mask parameter can be either any of the following
//! selection.
//! - \b USCI_UART_RECEIVE_INTERRUPT_FLAG -Receive interrupt flag
//! - \b USCI_UART_TRANSMIT_INTERRUPT_FLAG - Transmit interrupt flag
//!
//! Modified register is \b UCAxIFG.
//!
//! \return The current interrupt status, returned as with the respective bits
//! set if the corresponding interrupt flag is set
//
//*****************************************************************************
uint8_t USCI_UART_getInterruptStatus (uint32_t baseAddress,
    uint8_t mask)
{
   assert( 0x00 != mask && (USCI_UART_RECEIVE_INTERRUPT_FLAG +
			USCI_UART_TRANSMIT_INTERRUPT_FLAG 
			) );

    return ( HWREG8(baseAddress + OFS_UCAxIFG) & mask );
}

//*****************************************************************************
//
//! Clears UART interrupt sources.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is a bit mask of the interrupt sources to be cleared.
//!
//! The UART interrupt source is cleared, so that it no longer asserts.
//! The highest interrupt flag is automatically cleared when an interrupt vector
//! generator is used.
//!
//! The mask parameter has the same definition as the mask parameter to
//! USCI_UART_enableInterrupt().
//!
//! Modified register is \b UCAxIFG
//!
//! \return None.
//
//*****************************************************************************
void USCI_UART_clearInterruptFlag (uint32_t baseAddress, uint8_t mask)
{
    //Clear the UART interrupt source.
    HWREG8(baseAddress + OFS_UCAxIFG) &= ~(mask);
}

//*****************************************************************************
//
//! Enables the UART block.
//!
//! \param baseAddress is the base address of the USCI UART module.
//!
//! This will enable operation of the UART block.
//!
//! Modified register is \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void USCI_UART_enable (uint32_t baseAddress)
{
    //Reset the UCSWRST bit to enable the USCI Module
    HWREG8(baseAddress + OFS_UCAxCTL1) &= ~(UCSWRST);
}

//*****************************************************************************
//
//! Disables the UART block.
//!
//! \param baseAddress is the base address of the USCI UART module.
//!
//! This will disable operation of the UART block.
//!
//! Modified register is \b UCAxCTL1
//!
//! \return None.
//
//*****************************************************************************
void USCI_UART_disable (uint32_t baseAddress)
{
    //Set the UCSWRST bit to disable the USCI Module
    HWREG8(baseAddress + OFS_UCAxCTL1) |= UCSWRST;
}

//*****************************************************************************
//
//! Gets the current UART status flags.
//!
//! \param baseAddress is the base address of the UART module.
//! \param mask is the masked interrupt flag status to be returned.
//!
//! This returns the status for the UART  module based on which
//! flag is passed. mask parameter can be either any of the following
//! selection.
//! - \b USCI_UART_LISTEN_ENABLE
//! - \b USCI_UART_FRAMING_ERROR
//! - \b USCI_UART_OVERRUN_ERROR
//! - \b USCI_UART_PARITY_ERROR
//! - \b USCI_UART_BREAK_DETECT
//! - \b USCI_UART_RECEIVE_ERROR
//! - \b USCI_UART_ADDRESS_RECEIVED
//! - \b USCI_UART_IDLELINE
//! - \b USCI_UART_BUSY
//!
//! Modified register is \b UCAxSTAT
//!
//! \return the masked status flag
//
//*****************************************************************************
uint8_t USCI_UART_queryStatusFlags (uint32_t baseAddress,
    uint8_t mask)
{
    assert( 0x00 != mask && (USCI_UART_LISTEN_ENABLE +
			USCI_UART_FRAMING_ERROR +
			USCI_UART_OVERRUN_ERROR + 
			USCI_UART_PARITY_ERROR +
			USCI_UART_BREAK_DETECT + 
			USCI_UART_RECEIVE_ERROR +
			USCI_UART_ADDRESS_RECEIVED +
			USCI_UART_IDLELINE +
			USCI_UART_BUSY 
			));

